{
	"reviews": [
		{
			"user": "Angelo Orazio Pregoni",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar26187513_3.gif",
			"country": "Italy",
			"review": "I imagine Evita Peron drinking mate, in a room with scent traces of asado just eaten, and notes of amber and cinnamon all around the room! Wonderful! \nAnd Banderas waiting for a tango and for some meat too!\n\n“Evita! I love your scent of cinnamon steak!”\n\nBut honestly who cares what perfume she was using? \nBelow, an article with photos that tells of another fragrance dedicated to her, this time with a hint of rose!\n\nhttp://www.bordighera.net/evitaperon.htm\n\nThe truth is that this perfume had been requested by one of the seven dwarves in Snow White, but she (the Snow young girl) was allergic to cinnamon.  \nSo the Creed family kept it hidden for several centuries,  until the smell has moved from a fairy tale to a legend! \n\nIf you smell this one, it seems a Tyrolean broth for dwarf miners.\nThis reviewer may have conflicts of interest",
			"react": 1,
			"date": "2015-05-27 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "JackTwist",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United States",
			"review": "A very heavy, rose and ambergris dominated scent that is slightly medicinal with a strong menthol note. Hard to believe a celebrity like Eva Peron wore this - it's more repellent than attractive- perhaps she wore it when she was around people she didn't like.\n\nWith the heat of Argentina, this must have been positively mind and nose-numbing.\n\nLuca Turin did not like it, giving it only two stars and calling it a \"light oriental.\"  Light???\nHe noted it was \"strikingly devoid of either amber or cinnamon\" and described it smelling \"like a household product.\"\n\nBarbara Herman described it as a \"good girl perfume mixed in with perspiration and lust\" and noting its \"skanky quality.\" She ultimately found it \"heavenly.\"\n\nI find it \"hellish.\"\n\nTop notes: Cinnamon leaves, Juniper Berry\nMiddle notes: Rose, Cinnamon, Bay Leaves, Coriander\nBase notes: Ambergris, Musk",
			"react": 1,
			"date": "2014-12-29 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "LiveJazz",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar4867_23.gif",
			"country": "United States",
			"review": "I was so looking forward to smelling Ambre Canelle. A stately amber with cinnamon, one of my favorite notes. But alas, it did not agree with me. Ambre Canelle doesn't strike as particularly ambery, and I don't notice much of a cinnamon note, either. Mostly, I get stale soap and ambergris.Stuffman has described my experience with it perfectly, and I will quote him:\"At first whiff, it seemed to lie somewhere in the generic continuum between Youth Dew and Chanel No. 5, full of powder with no discernible masculinity whatsoever. As the scent dried down, the most prominent note to my nose was rose, overlayed on delicate powder with traces of cinnamon.\"Very soapy, and the soap clashes with the heavier spice elements in a way that just bothers me. This isn't what I signed up for. For a masculine Creed with comforting sillage and a very nice, toasty cinnamon note, look to Baie de Genievre, which beats this stuff in every way.",
			"react": 1,
			"date": "2010-07-06 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "Paul G",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar3701_5.gif",
			"country": "United States",
			"review": "Don't get this blind......there's a lot going on here and none of it's good.  It's a ambergris dominated scent that is thick, rich and gooey.  Picture a Creed perfumer behind hired by Serge Lutens.  Just didn't work.  Yikes, this one was terrible on my skin.  Dated and not something that could be pulled off in this era to my nose.  ",
			"react": 1,
			"date": "2006-04-14 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "DavidBond007",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar39450_7.gif",
			"country": "United States",
			"review": "Very perfumey fragrance, I could see a mature woman wearing this and smelling nice. I could not see myself wearing it, but it is well made.",
			"react": 2,
			"date": "2010-05-22 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "scentsitivity",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar9476_4.gif",
			"country": "United States",
			"review": "It is interesting to compare how Creed presents Ambre Cannelle at its UK and US websites (note: websites accessed on 11 Feb 10).    It is described at Creed’s UK boutique as an “intensely warm and spicy fragrance, with a blend of Ambergris and Cinnamon notes”.   Its notes are given as:Top notes: Cinnamon Leaves, Juniper BerryHeart notes: Rose, Cinnamon, Bay Leaves, CorianderBase notes: Ambergris, Tonkin MuskA very different presentation is given at the Creed US website.    It explains that Ambre Cannelle means Ambre Cinnamon and describes Amber as “a type of resin derived from the fir tree that grows in Patagonia in Argentina”.    Its notes are listed as:Top notes: Bergamot, BerriesHeart notes: Coriander, RoseBase notes: Vanilla, Amber and SpicesSignificantly different note pyramid here (note: they left out cinnamon!).  So which is it?   An amber scent or an ambergris scent?   I tend to think amber.   It is nothing like the ambergris drydown common to Creed Millesime fragrances.   But amber doesn’t dominate Ambre Cannelle.   The opening is very powdery, very soapy - also warm and spicy; I would even say stuffy.  There is nothing modern here.   Creed’s US website describes it as “classic and powdery in composition” and it certainly has a classic old-fashioned vibe to it.  If someone is looking for an amber presentation akin to Ambre Sultan or Ambre Fetiche, it is nothing like that.   Ambre Cannelle tends to the feminine.   (As an aside Creed used to market Ambre Cannelle as a unisex fragrance.  Now it is marketed as a feminine).   While the opening is a bit strong to my liking the drydown become subtle and delicate and rather pleasant.   It is just not something I am inclined to wait for.   Of the late 40s Creeds, I prefer Cypres-Musc and Vetiver.   Perhaps Ambre Cannelle would be nice on a lady.",
			"react": 2,
			"date": "2010-02-12 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "bokaba",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar12209_5.gif",
			"country": "United States",
			"review": "This is what a musky, ambery Victorian soap smells like! The opening is heady, brash, and unrestrained so I suggest you hide in the bathroom for thirty minutes after application. The raucous opening quickly subsides leaving a faint, close to the skin powder redolent of jasmine, bay leaf, ambergris, musk, cinnamon leaf, and a dash of lavender. After you get past the opening, this is quite a delicate scent, but dare not over-apply. ",
			"react": 2,
			"date": "2009-11-10 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "SirSlarty",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar17649_26.gif",
			"country": "United States",
			"review": "Ambergris with a little bit of civet. Very strange. Very strong. More of an oriental barbershop than true ambergris. \"Canelle\" in Frehnch means \"groove\".",
			"react": 2,
			"date": "2008-09-07 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "Caltha",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar5793_5.gif",
			"country": "Sweden",
			"review": "Smells purely like strong, old-fashioned, yellowish soap, which I've learned is because soap is (or was?) often scented with ambergris. A comfort scent, not of the usual gourmandy variety, but because it's evocative of a musty old house, perhaps one inhabited by a distant, elderly relative with interesting stories to tell. If you bathed there as a kid your skin would smell like this, and you would feel not quite clean but more imbued with the mysterious atmosphere of the place...",
			"react": 2,
			"date": "2007-03-17 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "robyogi",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar4088_5.gif",
			"country": "United States",
			"review": "This is definitely in the line of Creed's miscreant scents - the black sheep, the ones that don't want to play by the rules, don't want to stay all nice and dressed up, minding their manners at the formal family luncheons held in the great dining hall of the Creed family mansion.  In this group of misfits you've got: the festive lumberjack Baie de Genievre; the second cousin that lives in a cabin in the woods, Cypres Musc; the cousin that no one leaves alone with the children, Orange Spice; the straight-talking old codger Santal Imperial; the loopy young cousin Chèvrefeuille Original; and our current preoccupation, Ambre Canelle.  Of these deviants, Ambre Canelle is the weird uncle.  He's formal alright.  He dresses up well, but there's just something a little \"off\" about him.  He talks about government conspiracies and alien abductions.  He brings his own utensils to dinner.  He doesn't even seem to realize that other people try to avoid conversation with him, and then smile knowingly at each other when he suddenly stops a rant, makes a quick turn left, and walks away as if directed by voices they cannot hear.  There is stuff going on in Ambre Canelle that is interesting, amusing, and eccentric, but not altogether pleasant, and not something you'd want to have as your companion for any length of time, or in particularly sensitive situations, where your pride and reputation are on the line.  I, like ipaid, get lots of jasmine - very indolic - with a massive whop of amber.  But here the amber is drier than it normally seems.  The overall effect is a dry, powerful, eccentric, sillage monster.  Interesting, but odd. ",
			"react": 2,
			"date": "2007-01-28 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "Kaizen1972",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar26178992_26.gif",
			"country": "United States",
			"review": "A warm, spicy amber fragrance that does a good job conjuring up pleasant feelings. (Eva Peron was apparently a big fan of this scent.)\n\nAmber takes center stage in this Creed fragrance, and they made sure to use a really high-quality source for it (i.e., resin derived from a fir tree in the Patagonia region of Argentina...how cool is that?!).  Cinnamon also is a key ingredient here (thus the French \"canelle\" label), having a dusty bright quality that goes well with the fine amber. Rose plays a part to add a lovely, warm floral touch in what is overall a very sweet experience. \n\nI have to draw a comparison to Estee Lauder's Cinnabar here, but only on a very basic subjective level: Both are powdery, sweet and spicy, though Creed's Ambre Canelle is clearly the prestige, niche-level scent.\n\n",
			"react": 3,
			"date": "2018-09-19 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "Possum-Pie",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar13386408_1.gif",
			"country": "United States",
			"review": "This has a horrific medicinal opening, but it only lasts one minute.  Drying down brings an exquisite barbershop fragrance, mixed with soap.  This is actually a surprisingly original take on the men's scents of the 40s-50s.  With Creed's history of manipulating their history to meet their needs, this supposedly was created in the late 40s yet Creed didn't start selling frags until the 70s. Well done, Creed! ",
			"react": 3,
			"date": "2017-07-26 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "Way Off Scenter",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar26137576_22.gif",
			"country": "United States",
			"review": "Genre: Oriental\n\nWhoah! Quite the opening here: amber, very smooth, rounded cinnamon, and lots of soap. It's an entry that grabs me right away and then leaves me impatient to see where it will go next.\n\nThe soapy sensation might recall Cypres-Musc, but here the soap is balanced by a highly suggestive accord of indolic jasmine, rose, and amber. The whole thing smells like a self-contradiction, but in the most fascinating way. The constant tension between clean and \"dirty,\" civilized and feral, builds tremendous suspense as to just which way the balance will eventually fall.\n\nFor a time the rose takes control and molds Ambre Canelle into a very bold, yet slightly austere floral scent. Yet the yeasty, \"doughy\" quality in some rose essences is brought forward by the amber, eventually erasing the last traces of soap. At this point, three or more hours into its development, Ambre Canelle falls onto a luxurious amber and indole soaked cushion, upon which it stretches languidly for the remainder of its stay.\n\nA Creed that does not smell like any other, and which stands beside Angelique Encens, Royal English Leather, and Orange Spice as an exemplar in this old line.\n",
			"react": 3,
			"date": "2014-06-09 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "bugsyiii",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar11243_7.gif",
			"country": "United States",
			"review": "GREAT FRAGRANCE...NOT OF THE MODERN CREED EXPERIMENTATIONS....This fragrance opens with a barbershop feel to it! I can't specifically point out what notes I get, however, it is of that Creed traditional scent potion!! When you smell this, is is distinctively male, and has none of the familiar Creed elements that you would get in IM, GIT, NS, or any of the others. This fragrance is like that bottle of fine wine that only gets opened once every so often (of course, that is not a bad thing). This fragrance is of such quality that you wear this to experience that wow factor as one strolls through the park or the streets. Gentlemen, enjoy smelling like a king; enjoy the feeling that comes along with it!!!!Pros: OF A DIFFERENT ERA...Cons: N/A\"",
			"react": 3,
			"date": "2013-10-20 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "rbaker",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar13381457_1.gif",
			"country": "United Kingdom",
			"review": "The top note is a wonderful cinnamon note that then develops a fruity berry hint in which there was a touch of rose.  After about half an hour a softened barbershop-soapiness breaks through that dominates the basenotes.   I get only a whiff of amber, and towards the end a bit of vanilla.  Sweeter than Baie de Genievre, but much less sweet and intensive than Royal Delight, this is an elegant but warm scent.  I got about four hours out of it, with the initial cinnamon being the most alluring and convincing experience.  Clear but gentle, not cloying in cooler weather, sensual and great for a romantic evening. ",
			"react": 3,
			"date": "2012-06-13 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "Maximiliani",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United States",
			"review": "Youth Dew is what immediately comes to mind when smelling this. It's like Youth Dew for men. But it predates Youth Dew by four years! Cinnamon and amber for sure, and almost is completely Youth Dewish if not for something that skews it in the masculine or unisex direction.. can't put my finger on it. Less rose, less white flowers? More spices/herbs? Can't say. \n\nI'm quite sure my grandmother wore Youth Dew, which may be why I like this fragrance as it does suggest Youth Dew for me, and I'm sure many people's mother and grandmothers also wore Youth Dew, hence I'm sure people might cringe at trying a cologne that smells like their grandmother, but for me I don't really care, it's spices and is rather different enough from it that it can be safely worn. Really, I think you just need the right skin for it, reading the reviews on here,  I think different skin compositions certainly bring out different notes, and the notes I get are really nice.\n\nKind of like a cashmere sweater really. ",
			"react": 3,
			"date": "2010-12-29 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "JaimeB",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar2200_17.gif",
			"country": "United States",
			"review": "I can see now where Creed Baie de Genièvre came from. It is a stripping down of this rather more forceful scent. This one is more floral, more herbal, and more spice-laden than the streamlined version of 1986. The cinnamon is very prominent from the outset, and the development of the other layers of the scent is rather accelerated. It doesn't take long to catch on to the base notes. This is probably because the cinnamon leaves in the top call up the deeper cinnamon right away, and the rose, with its low odor detection threshold, is right up in one's nose at once. Very nice for cool weather or evening wear. Decent longevity; the big initial sillage tempers within half an hour or so.",
			"react": 3,
			"date": "2010-03-20 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "Stuffman",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar4660_4.gif",
			"country": "United States",
			"review": "I don't know if perhaps I've sampled too many fragrances today, or if the bottle at the Sak's Fifth Avenue in Pittsburgh was off (it wasn't there a month ago and was mostly full, so it probably wasn't), but this was nothing like what I expected it to be.At first whiff, it seemed to lie somewhere in the generic continuum between Youth Dew and Chanel No. 5, full of powder with no discernible masculinity whatsoever. As the scent dried down, the most prominent note to my nose was rose, overlayed on delicate powder with traces of cinnamon.  The ambergris and tonka are noticeable only by a vague smoothness and roundness in the base tying it all together.I'm disappointed that it's not something I can wear.But on the other hand, saying that it \"lie[s] somewhere in the generic continuum between Youth Dew and Chanel No. 5\" is no dig whatsoever- as both are stellar fragrances, and this one in particular lies above any other fragrances between the two. The rose note is beautifully rendered in the way only Creed can do florals, and the delicate, clean powder ties well into the subtle ambergris base. Overall, it's a stunning composition, but I'm afraid many won't take the time to appreciate its subtleties.",
			"react": 3,
			"date": "2008-12-28 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "beltz",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "Canada",
			"review": "A very sweet amber and cinnamon scent. It has powerful sillage so do not over apply, or you might smell like an old lady at first. It isn't very masculine because of its sillage and sweetness but I love wearing this for that very reason - you are constantly reminded of what you are wearing and it is pleasant. However, I still prefer to wear this at home because it's not something I want others to smell on me.",
			"react": 3,
			"date": "2008-07-17 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "tvlampboy",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar6543_29.gif",
			"country": "United States",
			"review": "Ambergris and cinnamon together -- yum!  This is a rich and old fashioned frag that -- more than any other Creed I can think of -- is definitively a \"love it or hate it\" number.  (And I love it.)The ambergris is so strong (think Youth Dew) and the whole effect so animalic yet ancient that I really can't effectively describe either in a few words.  The amber, btw, doesn't come in until considerably later in the frag's progression.  The cinnamon (canelle) you smell throughout, but more so later on.Try before you buy.  Try before you buy.  Try before you buy.  ",
			"react": 3,
			"date": "2008-01-11 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "markc",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar3023_5.gif",
			"country": "United States",
			"review": "Complex.  Great evolution here.  It starts out pretty heavy with something that smells a bit on the feminine side.  The drydown though, as others have said, changes and often.  Spice, ambergris, musk, all take turns like children on a sliding board.  Decent longevity and projection.",
			"react": 3,
			"date": "2007-10-24 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "foetidus",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar1658_26.gif",
			"country": "United States",
			"review": "Caltha is right:  This pretty much smells like that yellow lye soap that my mother made decades ago.  Ambre Canelle doesn’t have the acrid bite of homemade lye soap, but it seems like pretty much the same base…that’s a good thing.  The spices — a dose of cinnamon (more cinnamon leaf than cinnamon spice) and bay leaf —  fit in perfectly with the ambergris and the musk.  But, as IPaid and Robyogi both point out, the true star of this fragrance is jasmine: I’ve encountered only one or two other fragrances that could match this fragrance in indolic power.  I guess its the soapy clean and the indolic dirty combination that makes Ambre Canelle so compelling—it’s both clean and animalic; both spicy and musty — and all these characteristics done to excess.  The only other fragrance that I know of with such contrasts and excesses is Kouros.  As a matter of fact, I view Ambre Canelle the same way I view Kouros:  I don’t like it, but I totally love it.  I am intrigued — and I never thought a Creed could do this to me.",
			"react": 3,
			"date": "2007-10-15 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "signature",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar5613_5.gif",
			"country": "United States",
			"review": "This scent almost certainly had to be an influence on the creators of Paul Sebastion PS. On the first sniff they are strikingly similar, but whereas PS is slightly more dirty with a sort of rubber note that at times can be disturbing, Ambre Canelle opens slightly soaply and clean and evolves into a soft, ambery, cinnamon scent. The lack of any harsh notes and the powdery, calming nature of the drydown do infact  make the scent unisex. I am not quite sure that I can recommend this scent over PS for the average wearer especially since PS is much cheaper, but I can definitely recommend it for fragrance collectors that appreciate a scent that has a significant evolution.",
			"react": 3,
			"date": "2007-01-26 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "rach2jlc",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar3949_6.gif",
			"country": "United States",
			"review": "I really like this one, but I agree with the other reviews that say that it might not be a good one to buy blind. Those accustomed to GIT, Himalaya, Green Valley, MI, or Neroli Sauvage will probably be very surprised by this one.  Along with Baie de Genievre, it's my favorite \"non-Creed\" Creed, or one of those Creed fragrances that will surprise you, just when you think you've figured out what's going on with this house. The \"soapy/spicy\" opening others get is a blast of the pink pepper, which stays quite discernible until the drydown, but subsides to give more amber and cinammon.  Definitely worth a try, but sample it first. ",
			"react": 3,
			"date": "2007-01-24 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "zztopp",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar5380_17.gif",
			"country": "United States",
			"review": "Notes:TOP:Cinnamon leaves, pink pepper MIDDLE:Rose, cinnamon, bay leaf, corianderBASE: Ambergris, Tonkin MuskEven though Ambre Canelle (AC) isn't one of the more popular Creeds, I was intrigued by the name as well as the fact that it supposedly contains one of the highest quality ambergris notes in existence. Oh, and that its basically sex in a bottle.AC has an immediate impact. It took me multiple wearings to decipher its opening accord. Its soapy yet spicy, spicy yet skanky, skanky yet sweet, and sweet yet soapy. It gets even more perplexing as the fragrance evolves - theres a certain amplitude to this accord, which is perhaps brought on by the use of jasmine in concert with the pungent bay leaf and spicy coriander. It is startling and intriguing at the same time, and a far cry from the usual citrus/lavender opening accords of the mass fragrances. This soapy/indole-laden/spicy accord lasts for an hour before drying down to a luscious and provocative ambergris and musk combo. The ambergris smells slightly sweet, deep and powerful; its in fine form here, and the quality of ingredients shows. This whale vomit is so good, you might want to bath in it. The sensual drydown stretches the longevity to almost 7 hours. Ambre Canelle is an unusual and sensual offering from Creed. From its multifarious soapy/spicy/indolic first half to the ambergris-dominated pheromone-like drydown, its an arresting fragrance experience. It may not be for everyone, but once you are lured in by its composition and witness its bewitching effect on people around you, you may never want to go without a bottle in your collection.",
			"react": 3,
			"date": "2007-01-05 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "Strange Accord",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar5138_5.gif",
			"country": "United States",
			"review": "Most Creed fragrances have a strong bergamot and/or lavender overlay.  This intense fougere overlay has been long used by many houses and is no longer welcome in my world.I thought it would be interesting to see what I would think of a Creed that had no bergamot and lavender – if such a fragrance existed. Fortunately I had access to Michael Edwards’ [paid] online Fragrances of the World database.  I was able to look at Edward’s fragrance pyramids, which provide detailed descriptions of all of the notes in the Creed fragrances. I found Ambre Canelle which has none of the dreaded bergamot and lavender.  I ordered it and it arrived today.I like it a lot.   Because it is free of fougere notes, it is more unique and has a stronger personality than other scents in the Creed family. It is light, gentle and delightful to smell.  A man or a woman could wear this.  It is not sweet, but has a nice, gender neutral rose note.  It is pleasant, refreshing and makes me feel like getting down to business.  Would be nice in a workplace.  For people who wear scent seasonally, this would be a nice spring scent.",
			"react": 3,
			"date": "2006-04-28 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "IPaidForThisName",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "",
			"review": "Ambre Canelle is a hard one for me to understand. When I got it, I was expecting an amber and cinnamon fragrance. When I tried it, I got jasmine and a massive Creed House note. To this day, I don’t really get any cinnamon at all, but I do get Amber (I guess) as Creed defines it. I don’t know if anyone else gets this, but I find it very jasmine dominant. I do like it a lot. It’s rich, masculine, and floral. It’s not what I expected, but I like it nonetheless. ",
			"react": 3,
			"date": "2005-09-19 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "yepyep",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United States",
			"review": "A man or a woman could wear this scent.  The only notes listed on the creed site are ambergris and cinnamon.  Ambergris must smell wonderful then.",
			"react": 3,
			"date": "2005-02-12 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "jfortun",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "",
			"review": "Sex in a bottle.  The purest use of ambergris I have come across.  This is a powerful fragrance best reserved for romantic occasions and cooler weather.  Wonderful but dangerous!",
			"react": 3,
			"date": "2003-08-30 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "j_dubyah",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United States",
			"review": "A very fun, clean, barber-shop like scent.  Sweet.  Yet, on the negative side, it sort of reminds me of Paul Sebastian PS.  ",
			"react": 3,
			"date": "2002-09-24 00:00:00",
			"perfume_id": 26120000
		},
		{
			"user": "drseid",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar1361_4.gif",
			"country": "United States",
			"review": "Angelique Encens opens with a blast of aromatic tuberose and radiant frankincense, with a touch of supporting nutmeg-like ginger and slightly bracing herbal angelica.  Moving to the early heart the tuberose gradually recedes as the frankincense takes over as star supported by soft powdery vanilla and remnants of the herbal angelica.  During the late dry-down the frankincense remains in support though heavily diminished, ceding control to the dry, soft powdery vanilla that is sole star through the finish.  Projection is very good and longevity excellent at over 12 hours on skin.\n\nAngelique Encens is one of the few Creed compositions that had stayed under my radar, only surfacing when a friend asked if I had ever tried it.  Having answered that I hadn't, I quickly sought to rectify the situation, as the composition certainly has a significant following.  Having now worn the composition a couple times on skin I can't say I understand all the hoopla.  The open really is impressive, as a lovely natural smelling tuberose joins excellent frankincense, meshing perfectly with the ginger and angelica acting more as binder than anything else.  So far, so good...  Then the powdery vanilla from the base arrives and to a degree ruins things.  This powdery vanilla really is pretty dry and lacking sweetness, forming a soft powdery cloud that integrates with the frankincense very well, yet still seems to soften the effect rather than enhance it.  By the time the composition reaches its late dry-down, it is pretty much an all powdery dry vanilla affair that has been done many times before just as well as here.  In all fairness, this is a vintage composition, so maybe at the time the composition was created it was considered innovative, but I doubt it.  In the end, Angelique Encens opens strong but deteriorates as time passes, leaving one shrugging their shoulders as to what all the fuss is for.  One thing that should be mentioned to the composition's credit is Angelique Encens smells nothing like the style of most Creed compositions today, proving along with some of the other early house offerings that Creed used to have some more interesting stylistic range.  The bottom line is the $1120 per 250ml flacon on the aftermarket discontinued Angelique Encens is a welcome departure to the Creed compositions of today, but while it has some excellent ingredients and polish, its soft powder takes away a lot of its positive impact, earning it an \"above average\" 2.5 to 3 stars out of 5 rating and a solid neutral recommendation if one ignores its lofty price tag. ",
			"react": 2,
			"date": "2015-06-23 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "Colin Maillard",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar13400615_8.gif",
			"country": "Italy",
			"review": "The opening of Angelique Encens is fairly bold, a sort of fresh and incense chypre, surrounded by a remarkable dose of amber, resins (benzoin), a light powdery floral accord and something smelling like tangerine or neroli (I'm being generous, as it actually smells more like Fanta), on a base of vanillin and something sweet and slightly sticky which resembles to a sort of light rendition of castoreum. Several artificial notes going on here – from the whole floral-citral accord (\"floor cleaners\" realm) to the synthetic, but still decent incense note (an ambery, heavy, archaic and slightly gloomy incense à la Goutal's Encens Flamboyant). Ambery drydown. Not bad, but surely in my opinion not a masterpiece – rather a decent, shallow floral-fresh-ambery incense which wants to look older and better than it actually is. \n\n5,5-6/10",
			"react": 2,
			"date": "2014-08-04 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "adowds",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar24100_8.gif",
			"country": "Ireland",
			"review": "I have the same experience with Angélique Encens that 'the_good_life' has, really enjoying the first hour then finding the dry down increasingly hard work.  I'm not going to give a run down of the fragrance as others have pretty much covered everything, rather I'd like to comment on the element that pretty much governs Angélique Encens, ambergris.For those that are a little squeamish now would be a good time to stop reading.....Created by the bile duct of sperm whales, ambergris is a waxy substance that helps the whale pass sharp bones of large sea creatures that it inadvertently ingests.  How it is expelled is another matter.  I apologise if this is more information than the reader needs but I feel that the back story to ambergris is important and why the idea of smelling it in it's pure form can be more than some can bear.  Ambergris smells waxy, sweet, creamy, syrupy, slightly smoky and a little animalistic.  With a little used in a blend ambergris can give a smooth and round finish, but here in Angélique Encens it is left alone and unadulterated.  I find this smell nauseating in much the same way that hot fudge cake is if you have eaten way too much for main course, though the dessert has a more pleasant story to it's creation.Angélique Encens is indeed a classic and unique blend, and with fantastic longevity and sillage, one could hardly not recommend that everyone try it out.  8.4 oz is just too much for anyone though, like Blue Amber by Montale a little goes a long, long way with this much ambergris present.  The Neutral is only for my personal taste rather than the quality.",
			"react": 2,
			"date": "2009-10-01 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "bookbadger",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United States",
			"review": "In the midst of a long-term review of incense fragrances and must re-review Creed's Angelique. Looking for that perfect blend of Frankincense and Myrhh that I knew from high mass. Of course one may not want to walk about smelling like the inside of a church but still. To be continued. ( I did try this one but maybe there is a hazard to trying only incense fragrances one after the other. Some SAY they have both frankincense and myrhh when really they just have a lot of amber.)",
			"react": 2,
			"date": "2009-03-08 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "Joe_Frances",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United States",
			"review": "This is one of the most elusive fragrances I have ever had the pleasure, privilege and frustration to wear.  It is suave, soft, beautiful, masculine, feminine, angelic, spiritual and distant.  Some scents are bold and \"out there\"; others are subtle; others are what they call \"skin scents\" in that they ride close to the skin; this is a soul scent.  You can only smell it tangentially and by inference by looking into one's soul.  Like an old church with no present incense wafting, but a lingering impression of incense that was once there but is now mostly gone.  That is how I  experience this most amazing fragrance. Angelique Encens Tangentiale, what is that?  Is that my Angelique Encens?  Maybe, maybe not; strange I thought it was, how nice it was.  Too bad I really can't smell it.  Best for those who fully understand Kierkegaard's \"Being and Nothingess\".  The perfect scent for the equally elusive Greta Garbo.  Unisex, but better for gals.  Holy Subtle.  I would get it if I could get it, but I don't really get it.  My loss I guess.",
			"react": 2,
			"date": "2008-10-08 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "the_good_life",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar4825_7.gif",
			"country": "Germany",
			"review": "I wish Angélique Encens would stop at the beginning, when there's a perfect accord of vegetal angelica and (already) a noticeable presence of incense, with the bergamot providing a bit of freshness. However, as the drydown progresses it becomes headier and headier on my skin, reaching an almost headache-inducing intensity in the combined power of the florals and particularly the vanilla. At this point I come to agree with Caltha on the connotation of cheap perfume oil, which is a shame, knowing how fine a creation this is. But the overbearing vanilla inescapably conjures up olfactory images of $1.99 scented candles. The angelica and incense struggles to be heard in the background and they rebound somewhat, but ultimately I'll have to say that I could only wear this in deepest winter, in miniscule amounts. My 30% full apothecary bottle should thus last me well into the next century. This is a classic, \"old-fashioned,\" perfume which needs to be tried on skin.   ",
			"react": 2,
			"date": "2007-08-08 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "Caltha",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar5793_5.gif",
			"country": "Sweden",
			"review": "Rather weird... It fells \"vintage\", yet it has a sweet, powdery, even plasticky vanilla note that feels very contemporary to me. The combination is truly original, I haven't smelled any perfume like it. But is it any good? To my nose, it smells quite cheap, like a cheap perfume oil. It's the vanilla that does it. Loads of vanilla over a dry, woody incense base. In the drydown I get a hint of white floral and the slightest whiff of animalic notes. Worthy of Marlene Dietrich? Hardly! Perhaps in some role where she's disguised as blond angel with a heart of gold in white furs...",
			"react": 2,
			"date": "2007-03-14 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "teardrop",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar44009_3.gif",
			"country": "England",
			"review": "For me the first ten minutes are piercingly sharp. The impression is of aldehydes, but perhaps it's the angelica. I've only ever smelled the candied variety used for cake decoration, so I couldn't say for sure. After this, it settles into a more pleasantly earthy, herbal thing with a vanilla sweetness running through it. There's a white floral accord here, mostly tuberose, & a powdery incense. One hour in, there's a salty, savoury ambergris, & another hour later, the base is a sweet, woody, powdery amber. The projection is moderate after that opening salvo, & it all fades out around seven hours in. \nThis has a retro style, yet at the same time the vanilla adds a touch of modernity, & there's none of the \"turned\" feel that I sometimes get from vintage-style fragrances. The herbal notes give it a coldness, & yet there's a warmth to it, especially in the drydown. These contrasts certainly make it an interesting fragrance, & aside from the opening, I rather enjoyed this one.",
			"react": 3,
			"date": "2019-12-04 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "Kaizen1972",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar26178992_26.gif",
			"country": "United States",
			"review": "A unisex scent from Creed that could be worn by both genders, depending on personal preference with the elements of Angélique Encens. (Consider that one fan of this scent was Marlene Dietrich!)\n\nAmber helps this scent to be acceptable by either gender, as do the incense and some of the florals (e.g. jasmine, tuberose, angelica) and the vanilla. How about the Bulgarian Rose? That may be a make it or break for men. Overall, all these notes blend into a smooth, pleasing scent that feels unrestricted to either gender.\n\n\n",
			"react": 3,
			"date": "2018-09-19 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "HouseOfPhlegethon",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar26210582_125.gif",
			"country": "United States",
			"review": "Very interesting fragrance.  Musty.  Earthy. Funerary, dark floral.  Somewhat sultry, in a vintage way.  Sweetness drifts in and out.  Call me crazy but, I get a waft of York Peppermint Patty smell now and then. \n\nDelightful amber/vanilla presence hours later.  A monster for sillage.  The base reminds of Amber 114 by Histoires de Parfums.  A bottle of this just sold on ebay today, for $1,025.  I will admit this turned out to be a beautiful perfume and I'm glad I had a tiny sample to try it.  However, I don't think it warrants That high a price...\n\n",
			"react": 3,
			"date": "2018-05-06 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "N.CAL Fragrance Reviewer",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar13373062_4.gif",
			"country": "United States",
			"review": "Angelica and incense notes dominated the opening giving a rather incense and herbal like feel to it, which lasted approximately 2-3 hours. I had difficulties trying to find the tuberose and jasmine notes since they aren’t dominant in the scent. Observing more closely, I do get traces of these notes in the heart of the scent once the angelica and incense begins to tone down. While this is happening the vanilla and amber begin to creep up into the front from the background. The floral notes combined with the vanilla/amber combo sweeten the scent making it much smoother. After about 4 hours, the infamous vanilla drydown joined along with amber and incense takes center stage. I do get a hint of ambergris although this was not officially listed on the (UK) creed boutique website.  By now the fragrance stays closer to the skin but still irresistible. The lifetime of the scent is approximately 6-8 hours depending on the application. Along with Vintage Tabarome, Windsor, and Bois de Santal this is another yesteryear masterpiece from the classic Creeds. I’m proud to own this fragrance in my collection.  ",
			"react": 3,
			"date": "2015-01-26 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "Darvant",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar39711_4.gif",
			"country": "Italy",
			"review": "The Royal Creed Angelique Encens's ambergris-frankincense (aromatic-spicy) rendition is still nowadays one of the most irreproachable classic incense treatments of the worldwide perfumery and all at once a terrific subtle rose-frankincense-animalic powder soapy accord (of immense beauty and sophistication). I smell just balance and perfection. The angelica/light-talky ambergris/frankincense accord arouses an aromatic (vaguely minty-eliotropic) dusty-powdery assertive aura (for several of its facets vaguely conjuring by soon- but it happens mostly along the way - \"un-incensey\" juices a la Grossmith Phul-Nana- anyway also slightly incensey scents a la Bois d'Armenie jump on mind) while rose and white flowers counteract the barely resinous solemn accord with a soapy sophisticated (vaguely victorian and more mondane) spark. All the elements are in perfect symphonic balance while an arcane chypre-floral talky final trail provides a \"blow\" of classy refinement. The final vanilla is almost ghostly and anyway magistrally appointed in order to preserve the general dry harmony with a whiff of soapiness (in perfect empathy with the rose-patchouli clean botanic-earthy laundriness). The final incensey-eliotropic vibe is a part of a more complex articulated chypre accord and not a straightforward liturgical onedimentional feel. A great sophisticated incensey-floral ambergris guys.",
			"react": 3,
			"date": "2015-09-05 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "Way Off Scenter",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar26137576_22.gif",
			"country": "United States",
			"review": "Genre: Oriental\n\nA classic, and deservedly so! Angélique Encens goes on very soapy, with an immediate and potent blast of sweetened angelica. This is followed by a vanilla note that sweetens the scent even further. Before it can become too syrupy-sweet, the incense of the title wells up to add a sobering dry foundation. A complex blend of spices (I smell mace, black pepper, and perhaps a touch of cumin) enters soon after, along with a gentle white flower accord that nudges what started as a very \"masculine\" fragrance into the realm of unisex.\n\nAs the scent develops, the white flower accord becomes dominant and begins to seem \"perfumey\" in a very old-fashioned way. I usually prefer my incense a bit less sweet and floral, as in Dzongkha or L'Homme Sage, but Angélique Encens reveals tremendous depth and complexity, with more than one happy surprise turn in its development. It endures quite well on the skin, with impressive sillage and projection right on through its sweet vanilla-ambery drydown. A wonderful scent, though not for me the \"religious experience\" some have described. I certainly don't need 8 ounces(!) of the stuff.\n",
			"react": 3,
			"date": "2014-06-09 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "JackTwist",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United States",
			"review": "A totally unique scent - a shame it is discontinued.\n\nAmber and vanilla dominate with frankincense in the background. The use of angelica, which has a rich, deep earthy quality to it is unique in perfumery and the ambergris rounds it out beautifully. Certainly one of the best orientals I have encountered.\n\nNotes include angelica, vanilla, ambergris, rose, jasmine, thyme, frankincense, vanilla, musk and civet.\n\nCan be found occasionally on Ebay, but at exorbitant prices. Samples can be found at Surrender to Chance.\n\nWorth trying.",
			"react": 3,
			"date": "2014-04-14 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "rbaker",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar13381457_1.gif",
			"country": "United Kingdom",
			"review": "The opening is sweet floral with a very balanced incense note that us never cloying.  The drydown is dominated by vanilla, with a musky note and a touch of amber thrown in, to end with an ambergris that is elegant and sophisticated and unusual for an incense fragrance.  There is a bit of a powdery note to it towards the end.  All ingredients of this delightful fragrance are of supreme quality, and I get three hours out of it; with heavy application up to seven or eight hours.    This isa a sweet but not overwhelming scent of the utmost sophistication. \n",
			"react": 3,
			"date": "2012-08-08 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "Marcie",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "",
			"review": "Along with Selection Verte, this is one of the most beautiful perfumes I have ever smelled in my life.  Longevity and sillage  are both good and I too can't help but keep smelling my wrist when I wear this.  I hope Creed will still have it in their Paris boutique when my children get old enough to really appreciate visiting Europe.",
			"react": 3,
			"date": "2010-10-27 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "DavidBond007",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar39450_7.gif",
			"country": "United States",
			"review": "It has a floral vanilla smell to it. Personally I think it is more for a woman, I could never see myself wearing this.",
			"react": 3,
			"date": "2010-05-20 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "Mimi Gardenia",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar24381_263.gif",
			"country": "United States",
			"review": "This is another fragrance I could easily bathe in -if it were readily available ! I rate this as otherworldly- the same way I rate Vol de Nuit ,Apres L'Ondee .... To me, this is a masterpiece. I get perhaps a very light tuberose,floral ....lavender and powder and then it deepens to this gorgeous, violetty ,incensey, dramatic vanilla ,with a touch of amber on my skin. I love this ! It's not overpowering at all - just kinds of stays wispy on my skin . The name seems very appropriate. Since being reunited with this lovely scent- what have I done but look longingly at the various places online, in London that may ship safely abroad ! ",
			"react": 3,
			"date": "2009-10-08 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "brrrry",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar22974_11.gif",
			"country": "United States",
			"review": "Absolutely beautiful, from start to finish.  Sillage is well above average and that whiff you get keeps pulling your wrist closer to your nose. Vibert is right on the money in that I definitely get an animalic note (cumin, maybe, as he mentioned)  in there somewhere.  I have worn this four times and tonight I got it for the first time.  It's only there for about 5 to ten minutes but it is there and it is in charge for that short period.  The rest of the time is spent with vanilla and incense in what others here have described as an unbelievable drydown. It is really hard for me to conceive that this is from 1933.  It has a 70's/80's vibe to me, and IMO seems way ahead of it's time, compared to others from the same era.  I only visit this once in a while but what a treat when I do.",
			"react": 3,
			"date": "2009-09-17 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "jo_purple",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United Kingdom",
			"review": "I LOVE IT! Makes you feel sooooo special. It is glamour , drama, mystery and sophistication in a bottle. It gets better as the day goes on. I think I may have to buy more of this...!",
			"react": 3,
			"date": "2009-03-17 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "",
			"review": "I got this frag a week or so ago & i can honestly say it has a glowing almost warm scent to it. It has very good silage is not at all overpowering, a thumbs up for this creed.",
			"react": 3,
			"date": "2008-10-26 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "jenson",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar13528_16.gif",
			"country": "India",
			"review": "the first non-millesime that i tried and im totally bowled over. creed doing and Incense and doing it wiht some finesse and class. intense, flowery, incense based scent which is quite sharp inits opening...a perfect rendition of Angelica for me...a note that i will ahev in mind as reference...for someone who hasnt sniffed Angelica(like me)..think of it as a white flower...from a distant family of jasmine..slighty heady a a tinge of bitterness..the combination of this and incense is just too sharp and interesting. quite modern in approach for the time it was released..matter of fact i cudnt have imagined it was released in 1933. the base is a musky, vanillic, ambery accord with hints of spices softening things up. however, as pointed out by others...a 8.4 oz would be too much to take. ",
			"react": 3,
			"date": "2008-10-06 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "Lian",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar2749_8.gif",
			"country": "Netherlands",
			"review": "So if you are new to the world of perfume and you wonder what incense smells like in this case, imagine walking passed a new age store. That is how it smells like and it is wonderful and calming, but you do smell like an incense store. If you always liked the smell of incense when it is just laying in the room but not when you actually light it, then this is perfect for you.I´m not sure if I would want to smell like a new age store often enough to buy a bottle but it is a really well done perfume and accomplishes what I think it wanted to do.Again a very soothing perfume that could be perfect for the right person or activity.",
			"react": 3,
			"date": "2008-08-26 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "SirSlarty",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar17649_26.gif",
			"country": "United States",
			"review": "Beautiful, smooth and calming. I wore this to bed calm my nerves and cure insomnia. I woke up a rested man. I need to get a candle of this if it's available.",
			"react": 3,
			"date": "2008-08-05 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "odysseusm",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar9372_12.gif",
			"country": "Canada",
			"review": "Well, for me this was a disappointment.  I love \"churchy\" incense scents; ones that are resinous, dry, and woody.  They evoke a haunting, mysterious quality.  The fact that this scent was revived for the occasion of Pope Benedict's visit to the USA led me to think AA might be something along the lines I've described above.  But, as many have noted, this is a very sweet, musky, vanillan and floral scent.  It has only a passing acquaintance with incense.  Creed's Cypres-Musc is the sort of thing I had been expecting, and certainly Comme des Garcons' Incense line delivers the goods.  This is another pot of incense, and not my style.  Doesn't smell masculine to me at all.  Thumbs down because what the promotion suggests, and what the product delivers, are two different things.",
			"react": 3,
			"date": "2008-06-12 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "orchid74",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar11387_5.gif",
			"country": "Australia",
			"review": "It is a Creed masterpeiece. The well blended notes of angelica, vanilla, tuberose and incense is trully addictive. It is beautifully worn in the cold season, it has a gourmandy 'play-doh' note in the middle stage that is ethereal. Longevity is average and wears close to the skin in the last few hours but that is fine with me as I love spritzing it on carelessly as I have a whole 8.4 oz flacon to indulge myself in. My husband loves nozzling my neck when I wear this.    ",
			"react": 3,
			"date": "2007-06-24 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "foetidus",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar1658_26.gif",
			"country": "United States",
			"review": "There’s not much I can say about this that hasn’t been said already, so I’ll basically repeat.  Angelique Encens is an impossibly beautiful fragrance:  It boasts a luxurious and elegant opening of Angelica, incense, and vanilla that is just plain ethereal.   I love incense fragrances and the incense here is perhaps the most refined one I’ve encountered: Delicate and diaphanous, it gradually loses essence until it exists only as tiny wisps in final drydown.   After the ethereal opening, the Angelica combines with heart accord’s jasmine and rose for a softer, but equally beautiful accord, while the incense floats in and out and the amber grows strong enough to enter the exchange.  The Angelica then continues into the haunting ambergris base—by this time the vanilla has all but disappeared.  The notes seem fragile but are not, and the scent gives me the feeling of peacefully rising above the madding crowd… Angelique Encens is truly contemplative.  It has good longevity and an elegantly restrained sillage.  This is one of the great ones.",
			"react": 3,
			"date": "2007-06-24 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "hirch_duckfinder",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar2018_14.gif",
			"country": "United Kingdom",
			"review": "A thing of sublime beauty, I really cannot overstate my respect for this fragrance. It is dominated by the creed house Vanilla/Ambergris base (which is possibly in its best incarnation here) laced with a little smoky incense and an astoundingly good if subtle Angelica. This Angelica has similar herbal/floral characteristics to lavender (in a functional sense, it doesn't smell similar) and just adds a non-sweet piquancy to lift the blend. ",
			"react": 3,
			"date": "2007-04-08 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "tmgp24",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United States",
			"review": "definately smells like the old school perfumes.one little note in it reminds me of Tabu,don't know exactly what.i like it but i'm glad i didn't spend the big bucks for it.(bought a 10ml decant)it's nice but just doesn't make me go uuummm -like coco mademoiselle,j'adore or chanel # 5",
			"react": 3,
			"date": "2007-02-24 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "Coconut",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar7010_14.gif",
			"country": "Hong Kong",
			"review": "I received a sample from a dear friend a few weeks ago. I wore this on a special occassion and I had a truly wonderful experience with this. Angélique Encens is beautifully done and like a fine piece of jewelry by Harry Winston. It is heavenly and it is a scent made for the goddess. First sniff on my skin seemed like a strong trail of amber incense mixed with face powder. It has an excellent staying power and lasted for at least 8 hours on my skin. I love every bits and all stages of this scent. It doesn't smell sweet or cloying and very well balanced.  I have tried to compare AE with NU by YSL and Black Cashmere (2 famous incense scent). I personally think AE is a lot more classy, smoother and not as spicy as the others that I have mentioned. It screams vintage! Definately worth saving for a bottle of this gem.",
			"react": 3,
			"date": "2007-02-22 00:00:00",
			"perfume_id": 26120001
		},
		{
			"user": "nightcutter",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar12475_2.gif",
			"country": "United Kingdom",
			"review": "I normally like Dunhill fragrances - a lot.\n\nBut this is rubbish.\nIt's VERY light.\nAll I smell is a weak rubbery note and maybe a bit of ozone.\nStays incredibly close to the skin.\nStupid bottle top as well.\nVery disappointing.",
			"react": 1,
			"date": "2011-01-24 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "AnimaSola",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar25306_8.gif",
			"country": "United States",
			"review": "This is the only Dunhill fragrance that I've worn and not enjoyed. I bought it blind, and since it was Dunhill I thought it would be appealing to me. It has a weird and synthetically cloying smell, not unlike Burberry Touch and Kenzo colognes. A major disappointment.",
			"react": 1,
			"date": "2011-01-12 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "PerfumeCollector",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar42856_28.gif",
			"country": "United States",
			"review": "I really wanted to like this perfume a lot.  Judging just by its notes it sounded so apealling, but I could not find the \"Eccentricity\" of this perfume at all. It is so common, actually it reminds me of several other scents. The word for it is \"mediocre\", and that is being generous. On the other hand, it is not repulsive, it is actually pleasant and I could wear it anytime, specially if I want to go unnoticed because it will no call the attention of anybody. (Good \"camouflage\" scent???) LOL ",
			"react": 1,
			"date": "2010-12-12 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "foetidus",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar1658_26.gif",
			"country": "United States",
			"review": "X-Centric: synthetic to the max but not necessarily unpleasant: Annoying opening - generic middle - nice base. ",
			"react": 1,
			"date": "2009-08-10 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "tvlampboy",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar6543_29.gif",
			"country": "United States",
			"review": "CologneJunkie says it best: Hugo or some such nonsense, with a none-too-lovely drydown of cheap deodorant soap.  The PERFECT gift this Christmasolstihanumas for any relatives you love to hate (and vice versa).",
			"react": 1,
			"date": "2007-10-16 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Dimitrios",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar11223_6.gif",
			"country": "Greece",
			"review": "Hmmm .... weak thin & watery ..  smells like a child covered in watermelon ,, thank god for Edition & others by Dunhill ",
			"react": 1,
			"date": "2007-05-26 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "CologneJunkie",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar959_7.gif",
			"country": "United States",
			"review": "I was at Marshall's today checking out their sales & I saw this.  I gave it a quick spritz on the back of my hand.  BLECH!  Way too strong and masculine for my liking.  I asked the nearest SA where the bathroom was & she said in the back behind the shoe racks.  Well, when I got to the shoes, I found they had several pair of Converse Chuck Taylors, which I adore.  So I checked out the Chucks for several minutes before I got to the bathroom to wash it out.  Before I took the soap to the back of my hand, I sniffed what the drydown was like.  To me, it smelled just like Hugo!  Again, blech.  So I scrubbed my hand, and of course 3 hours later I can still smell it.  Now, it smells like Coast soap.",
			"react": 1,
			"date": "2005-09-13 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Stuey",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "",
			"review": "X-tra boring! --Dunhill is appealing to the masses on this debockle. It's not a bad scent at all, but it's neither original OR memorable in the least.  Run-of-the-mill scent; comes out fresh, fades fast.",
			"react": 1,
			"date": "2003-03-27 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "scentimus",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar3710_67.gif",
			"country": "",
			"review": "No I was not impressed !  It smells very much like Nautica Latitude and  Longitude.  The bottle is quite impressive a much funky modern purple version of the  Desire bottle.  I was very much impressed with Desire when it first came out.  This one is a  let down. ",
			"react": 1,
			"date": "2001-09-01 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Kaizen1972",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar26178992_26.gif",
			"country": "United States",
			"review": "I never was crazy for Dunhill X-Centric, but I did admire it from afar for being a sufficient, basic scent.\n\nStart with the eccentric volley of top notes, most of which were spices normally found in the heart of typical fragrances.  It gives a fresh, slightly aromatic spice citrus intro, meshing with the nice rose, delicate wet sweet touch of lotus, and iris-cousin freesia adding its unique peppery freshness.  And we head to the combo of dry wood, sweet amber, tar-like touch from guiac, floral-spicy sweet patchouli, and generic subtle musk.\n\nAll in all, it has an aromatic, woody spicy floral wetness and freshness.  Not at all cloying, but overall safe and unadventurous.\n\nIt's an okay scent, but at least within the Dunhill universe, I have plenty of other options to satisfy.\n",
			"react": 2,
			"date": "2018-08-20 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Oviatt",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar9720_5.gif",
			"country": "United States",
			"review": "This is the best of the least--by which I mean that at Dunhill's lowest ebb, they were producing some really mediocre scents. X-Centric, which is from that period, is not bad.  For Dunhill, which was and wants to be again a serious fashion brand, the gimmicky name (XS all over again.....) and the gimmicky bottle (albeit from a house known for its lighters) seem out of line with their image.  The scent itself?  Woody, floral and spicy--quite nice, actually, if a little artificial smelling.  Some of my favorite notes, clary sage (which Dunhill has always used to great effect) and Guaiacwood, along with the cedar and cypress, create a woody base for the very floral heart and spice notes.  With the amber and patchouli this could almost be a masculine floriental, but one that has been put on a diet.  The ad campaign seemed totally at odds with this scent, which is neither dangerous nor eccentric ",
			"react": 2,
			"date": "2015-05-12 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Shaheen",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar24364_5.gif",
			"country": "United States",
			"review": "One part fresh aquatic fragrance mixed with one part spicy woody fragrance.  It's all quite subtle to my nose.  Not as in-your-face and synthetic as some of the other Dunhill fragrances.  It's nice, but not nice enough to add to my \"To Buy\" list.",
			"react": 2,
			"date": "2008-09-30 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Bigtruck260",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar52463_3.gif",
			"country": "United States",
			"review": "OK - this one was my go-to in the early 2000's....and if I could find it cheap in quantity, I would be wearing it again. On my skin, it had a tobacco type smell (which I love) and it was pretty even and fresh. I had to layer it pretty good for an evening out...and I guess that helped with the longevity. I found it to be masculine and sexy - and the wife dug it too.",
			"react": 3,
			"date": "2011-02-20 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "warlandsboy",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar33877_21.gif",
			"country": "Canada",
			"review": "I used to wear this a lot in highschool as I found it to be very clean, simple, and non-offensive to those around me. Some may say it's a bit generic smelling, but that's not necessarily a bad thing if that's what you want, right? ",
			"react": 3,
			"date": "2009-09-04 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Algharb",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "Portugal",
			"review": "Feel very fesh with it. Not a long lasting one, and a bit confusing towards the end... Will not by another bottle - yet, a nice EdC for Summer time.",
			"react": 3,
			"date": "2008-11-20 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Max1mu51",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United States",
			"review": "Everybody, meet Mr. Cologne Chameleon.  He adapts to any and every environment, wore it to work yesterday and its smoothness blends in to make a great office wearable cologne. Then after re-applying, my wife and I went to church, and it changed its color once again. So chic and cutting edge. It’s good enough to wear with a suit. It's jovial, sexy, woody, sweet, slightly spicy, very aromatic, good silliage, average longevity.  I used to wear this when if first came out, and forgot all about it, years down the line I got to thinking about how great is was and purchased a bottle. This is swiftly going to the top of my collection.-MAX",
			"react": 3,
			"date": "2008-11-13 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "SirSlarty",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar17649_26.gif",
			"country": "United States",
			"review": "An oily fresh aromatic aquatic. Spicy as well. Unique. Nice woody drydown.",
			"react": 3,
			"date": "2008-07-05 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "paul",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United Kingdom",
			"review": "I'm still wearing it It still smells weird (Police is reminiscent) and I still love it",
			"react": 3,
			"date": "2010-08-07 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "G23riel",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar8763_5.gif",
			"country": "Romania",
			"review": "A modern sporty, fresh smell.  I love the smell, but it does not have much dimension and surprisingly top, middle and base notes blend together.  I would admit it is  kinda generic smelling, ie a Nautica cousin, but it is nice and more modern.  The staying power is above average although truth be said, Nautica Competition stays a bit longer.  A sporty daywear.  Good fragrance for the price.",
			"react": 3,
			"date": "2007-01-21 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Jon_Remy",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar2388_5.gif",
			"country": "United States",
			"review": "I bought this a couple of years back.  I didn't buy it outright, but sprayed it on my wrist and left the store.  I kept having to smell my wrist throughout the day because I found it to be rather quite pleasing.  I was quite surprised (for a blue fragrance) that it lasted almost all day.  I ended up buying it and have bought it ever since.  A very clean fragrance that has a lasting quality.  To tell you the truth, you can't go wrong with ANY Dunhill fragrances.  In my opinion, Dunhill creates some of the most original and lovely fragrances that LAST.  I particularly love the classis Dunhill Edition.  I think Desire smells like Ferrari Black.  ALL Dunhill fragrances are WINNERS and you can't go wrong with ANY of them.",
			"react": 3,
			"date": "2006-10-26 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Ronald",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar4113_5.gif",
			"country": "",
			"review": "Very nice, if somewhat middle-of-the-roadish. A pleasant, fruity/fresh aquatic with a woody drydown that's most appropriate for daytime/office wear. Discreet, and lasts a fairly long time. Along with AdG, this was a signature scent of mine when I was working on my dissertation, so I tend to think of it as a \"grad school\" fragrance. Not necessarily for the youngsters, but not for the oldsters either... best for the in-between thirty-somethings.",
			"react": 3,
			"date": "2005-10-14 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "dallasconundrum",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "",
			"review": "I will start off by saying that I am big fan of the dunhill line. This fragrance is no exception. However, it is not among my favorites of the brand. It IS a good scent though, just not as impressive as some of the others. I really like the topnotes, but I like the dry-down less. Upon dry-down it is very woodsy to me which is nice but not my favorite type of scent. The cedar note really rings through to me as it dries down. So, all in all a positive review, the fragance is worth a shot, but I won't say buy it blind. Walk don't run for this one.",
			"react": 3,
			"date": "2005-08-31 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "chris_cologne",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "",
			"review": "Good, not great.  Kind of a fruity, aquatic mix.  The top notes have a tarty \"zinginess\" to it that evokes the products name.  The bottle, like its predecessor is great.  Hopefully this house will continue to move forward in the future and not go the way of Davidoff.",
			"react": 3,
			"date": "2003-12-22 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "Vialman",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "",
			"review": "I was at a local Macy's today, and they had X-Centric, and samples!!! Vialman was happy:-) I did get a bottle ( couldn't resist) and body lotion and shower gel!! Cha Ching!!! Jackpot!!  I like the watery floral mix... very aquatic!  The clary sage and freesia really stand out on my skin as well!! ",
			"react": 3,
			"date": "2001-09-06 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "keoniahlo",
			"profile_img": "http://www.basenotes.net/customavatars/thumbs/avatar2548_1.gif",
			"country": "United States",
			"review": "I just picked up a spankin' new 100ml bottle today at the local dunhill boutique. The bottle follows in the footsteps of it's awesome older brother, Desire...very cool indeed All I can say is I LOVE THIS SCENT! Can't put my finger on any particular note at this time...heck, can't really compare it to anything else I've whiffed in the past. I would say that it does fit right into the same family as their last fragrance, Desire, but it's not as spicy; sort of an understated boldness (oxymoron?) about it that I really like. It exudes confidence & maturity. Definitely not something the high school guy's gonna dig (not to dis any high school members here, just referencing the age/taste thing)I like dunhill Desire a lot--but I really, really like X-Centric. I loved it at first whiff! To be honest, the first time I tried Desire, I didn't really care for it...but that's probably because it, too, is quite different from most fragrances out there--but it's really grown on me--not to mention the frequent compliments that I get from women when I wear it :-). The best part of my story is that MY WIFE LIKES IT. For those of you that know me, that's been the hardest part of my quest for the ultimate fragrance--the WAF (wife acceptability factor). My personal rating for X-Centric: I give this one a two thumbs-up. Five stars. A+. Da bomb. Yeah, baby! ",
			"react": 3,
			"date": "2001-09-03 00:00:00",
			"perfume_id": 26120003
		},
		{
			"user": "cheadle",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "Nigeria",
			"review": "Not a popular name where i live, so when i came across a gift pack of Space 100ml i couldnt resist it. So off i went with Space. One spray and i thought OH NO! not detergent again... i was really sampling different scents back then and i had gone through polo sport, wings, givency incense ultramarine, cool water etc..and i was looking for something different and i got hit by this. Not a bad scent itself quite refreshing and formal. If i came across it today would i buy it? probably.   ",
			"react": 2,
			"date": "2007-05-22 00:00:00",
			"perfume_id": 26120005
		},
		{
			"user": "zenpiper",
			"profile_img": "http://www.basenotes.net/vbimages/misc/unknown.gif",
			"country": "United States",
			"review": "Wonderful.  I bought a mini on eBay, thinking I was getting a larger size.  Well, no matter; this is a terrific fragrance, though I am not astute enough to be able to describe the notes.  The opening is fairly intense, and there is a note (fig?) that others may recognize, which is compelling and good.  When it dries down there's an intoxicating aquatic/marine note that emerges.  Just lovely, lasts quite well.  Worth a mini for sure.",
			"react": 3,
			"date": "2007-03-01 00:00:00",
			"perfume_id": 26120005
		}
	]
}